app/Controllers/Categorias.php

SELECT *
FROM `categoria`
---
    public function index()
    {
        $session = session();
        if($session->get('logged_in')!=true || $session->get('tipoUsuario')!=1 || $session->get('valido')!=1){
            return redirect()->to(base_url('/login'));
        }


        $categoriaM = model('CategoriaM');
        $data['categorias'] = $categoriaM->findAll();